//如：
//
//n=728，x=7
//
//可以按照这样的思路：
//
//个位7:73个 7,17,...,727
//
//十位7:70个 70~79,170~179,...,670~679
//
//百位7:29个 700~728
//
//答案是172
#include<bits/stdc++.h>
using namespace std;

int main()
{
  long long n,x,m=1,ans=0;
  scanf("%d%d",&n,&x);
  while(m<=n)
  {
    //a,b,c为n的三部分，求哪一位x的个数，b就为那一位数，a为b左边的数，
    //c为b右边的数，如求1~728中十位7的个数，则a=7，b=2，c=8
    //如123,第一次循环a,b,c分别是12,3,0,第二次为 1,2,3，第三次为0,1,23
    //如1234,第一次循环a,b,c分别是123,4,0,第二次为 12,3,4，第三次为1,2,34，第四次为0,1,234
    int L=n/(m*10),now=n/m%10,R=n%m;
    if(x)
    {
      if(now>x)
        ans+=(L+1)*m; //如果b>x，说明有(a+1)*m个x（如求1~728中个位7的个数，则为（72+1）*1=73）
      if(now<x)
        ans+=L*m; //如果b<x，说明有a*m个x（如求1~728中十位7的个数，则为7*10个）
      if(now==x)
        ans+=L*m+R+1; //如果b=x，说明有a*m+c+1个x（如求1~728中百位7的个数，则为0*100+28+1=29）
    }
    else  //x=0的情况和x！=0的情况有所不同
    {
      if(now)
        ans+=L*m;
      else
        ans+=(L-1)*m+R+1;
    }
    m*=10;
  }
  printf("%lld\n",ans);
  return 0;
}
